app/views/frames/_side.html.erb

            <% end %>
            <% session[:categories].each do |category| %>
---
SELECT "categories".* FROM "categories"