app/views/frames/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
              <div class="six columns author-holder">
                <span><%= commit.user.full_name %> in category <%= commit.page.category.title.capitalize %></span>