app/controllers/categories_controller.rb

	def show
		current_team = Team.find_by(id: session[:current_team]["id"])
		@category = Category.find_by(slug: params[:title_slug])
		@team_users = current_team.users.select {|user| user.categories.exclude?(@category)}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "cat_users" ON "categories"."id" = "cat_users"."category_id" WHERE "cat_users"."user_id" = ?  [["user_id", 2]]

	def create
		@category = current_user.categories.create!(category_params)
---
INSERT INTO "cat_users" ("user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["category_id", 5], ["created_at", 2017-02-15 12:50:00 UTC], ["updated_at", 2017-02-15 12:50:00 UTC]]
INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Editing"], ["description", "Everything related to typography"], ["created_at", 2017-02-13 12:24:04 UTC], ["updated_at", 2017-02-13 12:24:04 UTC]]

	def destroy
		Category.find_by(slug: params[:title_slug]).delete
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 5]]

	def add_user
		user = User.find_by(id: params[:user_id])
		Category.find_by(slug: params[:title_slug]).users << user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "cat_users" ("user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["category_id", 5], ["created_at", 2017-02-16 12:38:22 UTC], ["updated_at", 2017-02-16 12:38:22 UTC]]