app/controllers/categories_controller.rb

	def destroy
		@category = Category.find_by(title: params[:title]).delete
---
SELECT  "categories".* FROM "categories" WHERE "categories"."title" = ? LIMIT ?  [["title", "tktitk"], ["LIMIT", 1]]

	def add_user
		user = User.find_by(id: params[:user_id])
		Category.find_by(title: params[:title]).users << user
---
SELECT  "categories".* FROM "categories" WHERE "categories"."title" = ? LIMIT ?  [["title", "typography"], ["LIMIT", 1]]