app/views/categories/show.html.erb

SELECT "users".* FROM "users"
---

          <% @category.users.each do |u| %>