app/controllers/users/registrations_controller.rb

  def create
    @token = params[:invite_token]
    if @token != nil
      @newUser = build_resource(sign_up_params)
      @newUser.save
---
INSERT INTO "users" ("email", "encrypted_password", "first_name", "last_name", "job_title", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "sign_in_count" = ?, "current_sign_in_at" = ?, "last_sign_in_at" = ?, "current_sign_in_ip" = ?, "last_sign_in_ip" = ?, "updated_at" = ? WHERE "users"."id" = ?