app/controllers/users/sessions_controller.rb

SELECT "categories".* FROM "categories" INNER JOIN "cat_users" ON "categories"."id" = "cat_users"."category_id" WHERE "cat_users"."user_id" = ?  [["user_id", 1]]
---
  def create

    super

    unless session[:current_team]
	    session[:categories] = current_user.categories.where(team_id: current_user.teams.first.id)
	    session[:current_team] = current_user.teams.first